In [72]:
import pandas as pd
import numpy as np

#crate data frame

data={'col1':[1,2,3,4,5],'col2':[6,7,8,9,10],'col3':[11,12,13,14,15]}
df=pd.DataFrame(data)

In [ ]:
#1.1
df[['col1','col2']]

   col1  col2
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [ ]:
#1.2
print(df[df['col1']>2])

   col1  col2  col3
2     3     8    13
3     4     9    14
4     5    10    15

In [ ]:
#1.3
df['col4']=df['col1']+df['col2']
print(df)

   col1  col2  col3  col4
0     1     6    11     7
1     2     7    12     9
2     3     8    13    11
3     4     9    14    13
4     5    10    15    15

In [ ]:
#1.4
df=df.drop('col4',axis=1)
df

   col1  col2  col3
0     1     6    11
1     2     7    12
2     3     8    13
3     4     9    14
4     5    10    15

In [ ]:
#1.5
df.at[2,'col2']=np.NaN
df

   col1  col2  col3
0     1   6.0    11
1     2   7.0    12
2     3   NaN    13
3     4   9.0    14
4     5  10.0    15

In [ ]:
#1.6
df.isnull().sum()

col1    0
col2    1
col3    0
dtype: int64

In [ ]:
#1.7
df=df.fillna(0)
df

   col1  col2  col3
0     1   6.0    11
1     2   7.0    12
2     3   0.0    13
3     4   9.0    14
4     5  10.0    15